Проектная группа – сообщество работающих над проектом людей, объединённых с целью создания качественного программного продукта в ограниченные сроки в рамках отведенного бюджета.
Роли: 
1)	Руководитель проекта
2)	Менеджер по маркетингу
3)	Разработчик
4)	Тестер
5)	Технический писатель
6)	Логист

1)	Руководитель проекта – отвечает за разработку качественного продукта в срок и в рамках установленного бюджета:
Основные виды деятельности:
2)	Отвечает за соответствие продукта фирменному стилю своей компании и за маркетинговую деятельность после выпуска.
3)	Отвечает за удовлетворенность заказчика. 
Разработчиков, как правило, бывает несколько:
•	Разработчик архитектуры
•	Аналитик предметной области
•	Специалист по интерфейсу
•	Программист
4)	Отвечает за согласованный и надёжный продукт
5)	Отвечает за продукт. Который можно использовать и сопровождать
6)	Отвечает за гладкое внедрение продукта

Тестирование ПО – Процесс проверки соответствия заявленных к продукту требований и реально реализованной функциональности, осуществляемый путем наблюдения за его работой в искусственно созданных ситуациях и на ограниченном наборе тестов, выбранных определённым образом.

Модульное тестирование – это уровень тестирования позволяет проверить функционирование отдельно взятого элемента системы. Что считать элементом – модулем системы определяется контекстом.

Интеграционное тестирование – данный уровень тестирования является процессом проверки взаимодействия между программными компонентами/ модулями. 

Системное тестирование – охватывает целиком всю систему. Системное тестирование обычно фокусируется на нефункциональных требованиях – безопасность, производительности, точности, надёжности, тп. На этом уровне также тестируется интерфейсы к внешним приложениям, аппаратному обеспечению, операционной среде и тд.
